In [1]:
%load_ext sql

In [2]:
%sql mysql://root:root@localhost

In [3]:
%%sql

#create schema q1270;
use q1270;

Create table If Not Exists Employees (employee_id int, employee_name varchar(30), manager_id int);
Truncate table Employees;
insert into Employees (employee_id, employee_name, manager_id) values ('1', 'Boss', '1');
insert into Employees (employee_id, employee_name, manager_id) values ('3', 'Alice', '3');
insert into Employees (employee_id, employee_name, manager_id) values ('2', 'Bob', '1');
insert into Employees (employee_id, employee_name, manager_id) values ('4', 'Daniel', '2');
insert into Employees (employee_id, employee_name, manager_id) values ('7', 'Luis', '4');
insert into Employees (employee_id, employee_name, manager_id) values ('8', 'John', '3');
insert into Employees (employee_id, employee_name, manager_id) values ('9', 'Angela', '8');
insert into Employees (employee_id, employee_name, manager_id) values ('77', 'Robert', '1');

 * mysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

C:\ProgramData\Anaconda3\lib\site-packages\sqlalchemy\engine\default.py:717: Warning: (1050, "Table 'employees' already exists")
  cursor.execute(statement, parameters)

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql 
select * from employees

 * mysql://root:***@localhost
8 rows affected.

[(1, 'Boss', 1),
 (3, 'Alice', 3),
 (2, 'Bob', 1),
 (4, 'Daniel', 2),
 (7, 'Luis', 4),
 (8, 'John', 3),
 (9, 'Angela', 8),
 (77, 'Robert', 1)]

In [17]:
%%sql


select employee_id
from employees
where manager_id in (select employee_id
from employees
where manager_id in (select employee_id
from employees
where manager_id = 1 and employee_id != manager_id))

union

select employee_id
from employees
where manager_id in (select employee_id
from employees
where manager_id = 1 and employee_id != manager_id)

union 

(select employee_id
from employees
where manager_id = 1 and employee_id != manager_id)

 * mysql://root:***@localhost
4 rows affected.

[(7,), (4,), (2,), (77,)]

In [34]:
%%sql

select e1.employee_id
from employees e1 ## SDE

join employees e2 ## Project Manager
on e1.manager_id = e2.employee_id

join employees e3  ##Boss/CEO
on e2.manager_id = e3.employee_id
where e3.manager_id = 1 and e1.manager_id != e1.employee_id

 * mysql://root:***@localhost
4 rows affected.

[(2,), (4,), (7,), (77,)]